#Οι πίνακες L και U
L=[10,10,35,35,130,125]
U=[125,150,225,210,325,315]

#Οι πίνακες a,b,c,d,e
a =[0.15247,0.10587,0.02803,0.03546,0.02111,0.01799]
b =[38.53973,46.15916,40.3965,38.30553,36.32782,38.27041]
c =[756.79886,451.32513,1049.9977,1243.5311,1658.569,1356.6592]
d =[0.00419,0.00419,0.00683,0.00683,0.00461,0.00461]
e =[0.32767,0.32767,-0.54551,-0.54551,-0.51116,-0.51116]
g =[13.85932,13.85932,40.2669,40.2669,42.89553,42.89553]

#Ορίζουμε τον πινακα B και τον αρχικοποιούμε
B = [[0 for x in range(6)] for x in range(6)]
B[0][0],B[0][1],B[0][2],B[0][3],B[0][4],B[0][5]=1.40,0.17,0.15,0.19,0.26,0.22
B[1][0],B[1][1],B[1][2],B[1][3],B[1][4],B[1][5]=0.17,0.60,0.13,0.16,0.15,0.20
B[2][0],B[2][1],B[2][2],B[2][3],B[2][4],B[2][5]=0.15,0.13,0.65,0.17,0.24,0.19
B[3][0],B[3][1],B[3][2],B[3][3],B[3][4],B[3][5]=0.19,0.16,0.17,0.71,0.30,0.25
B[4][0],B[4][1],B[4][2],B[4][3],B[4][4],B[4][5]=0.26,0.15,0.24,0.30,0.69,0.32
B[5][0],B[5][1],B[5][2],B[5][3],B[5][4],B[5][5]=0.22,0.20,0.19,0.25,0.32,0.85

for run in range(1,5):#Θα τρέξουμε τις αλγοριθμικές διαδικασίες 5 φορές για πιο ακριβή αποτελέσματα
    print("Εκτέλεση Νο",run)
    #αρχικοποίηση και randomize του πίνακα f
    import random 
    f=[0,0,0,0,0,0]
    for i in range(6):
        f[i]=random.randrange(L[i], U[i], 1)

    #Εισαγωγή απο τον χρήστη του power demand και ελεγχός του
    pd=int(input("Δώστε τίμη για το pd (επιτρεπτές τιμές 500mW,700mW,900mW)"))

    while (pd!=500 and pd!=700 and pd !=900):
        print("Δώσατε τη μη επιτρεπτή τιμή",pd)
        pd=int(input("pd ="))      

    #Υπολογισμός του pl
    pl=0
    for i in range(6):
        for j in range(6):
            pl=pl+B[i][j]

    #Υπολογισμός του Fcost
    Fcost=0
    for i in range(6):
        Fcost=Fcost+a[i]*pow(f[i],2)+b[i]*f[i]+c[i]

    #Υπολογισμός του Εcost
    Ecost=0
    for i in range(6):
        Ecost=Ecost+d[i]*pow(f[i],2)+e[i]*f[i]+g[i]

    #Αρχικοπίηση και υπολογισμός του πίνακα u
    u=[0,0,0,0,0,0]

    for i in range(6):
        u[i]=(a[i]*pow(U[i],2)+b[i]*U[i]+c[i])/d[i]*pow(U[i],2)+e[i]*U[i]+g[i]
        
    #Υπολογισμός του penalty factor
    penf=0
    i=0
    while (penf<pd):
        penf=penf+U[i]
        i=i+1

    #Αρχικοποίηση και υπολογισμός του χ πίνακα
    x=[0,0,0,0,0,0]    
    for i in range(6):
        x[i]=(a[i]*pow(f[i],2)+b[i]*f[i]+c[i])+penf*(d[i]*pow(f[i],2)+e[i]*f[i]+g[i])

    #Εκτύπωση των αποτελεσμάτων
    print("To pl του case-study ειναι: pl=",pl)
    print("Για power demand",pd,"mWatts έχουμε")
    print("FC=",Fcost)
    print("EC=",Ecost)
        
        
       
                             
